#姓名=input("請輸入您的姓名：")
#出生年=input("請輸入出生年：")
#年齡=2023-int(出生年)
#print(姓名+"您好，您出生於"+出生年+"年，您今年"+str(年齡)+"歲")
#print(f"{姓名}您好，您出生於{出生年}年，您今年{年齡}歲")

#一號餐 =100
#二號餐=200
#三號餐=300
#不升級=0
#A套餐=10
#B套餐=20
#點餐=input("請問您要哪種餐點：(1)一號餐,(2)二號餐,(3)三號餐")
#套餐=input("請問您要升級成套餐嗎：(A)A套餐,(B)B套餐,(C)不升級")
#if 點餐 == "1":
#    if 套餐 == "C":
#        print("您的餐點總共是"+str(int(一號餐)+int(不升級))+"元")
#    if 套餐 == "A":
#        print("您的餐點總共是"+str(int(一號餐)+int(A套餐))+"元")
#    if 套餐 == "B":
#        print("您的餐點總共是"+str(int(一號餐)+int(B套餐))+"元")
#if 點餐 == "2":
#    if 套餐 == "C":
#        print("您的餐點總共是"+str(int(二號餐)+int(不升級))+"元")
#    if 套餐 == "A":
#        print("您的餐點總共是"+str(int(二號餐)+int(A套餐))+"元")
#    if 套餐 == "B":
#        print("您的餐點總共是"+str(int(二號餐)+int(B套餐))+"元")
#if 點餐 == "3":
#    if 套餐 == "C":
#        print("您的餐點總共是"+str(int(三號餐)+int(不升級))+"元")
#    if 套餐 == "A":
#        print("您的餐點總共是"+str(int(三號餐)+int(A套餐))+"元")
#    if 套餐 == "B":
#        print("您的餐點總共是"+str(int(三號餐)+int(B套餐))+"元")

#成績系統 = ["小明",60,"小華",70,"小杰",80]
#print(成績系統)
#print(f"""現在成績系統登入的學生數為{int(len(成績系統)/2)}人""")
#操作 = input("請輸入操作指令(A)查詢(B)新增(C)修改(D)刪除").upper()
#if 操作 == "A":
#    姓名 = input("請輸入想要查詢的學生姓名：")
#    if 姓名 not in 成績系統:
#        print("查無此人")
#    else:
#        位置 = 成績系統.index(姓名)
#        print(f"{姓名}的成績為{成績系統[位置+1]}")
#if 操作 == "B":
#    姓名 = input("請輸入要新增的學生姓名：")
#    if 姓名 in 成績系統:
#        print("學生成績已登記於成績系統上了")
#    else:
#        成績 = input("請輸入學生的成績：")
#        成績系統.extend([姓名,int(成績)])
#        print(成績系統)
#if 操作 == "C":
#    姓名 = input("請問要修改哪位學生的成績：")
#    成績 = input("修改後的成績：")
#    if 姓名 not in 成績系統:
#        print("查無此人")
#    else:
#        位置=成績系統.index(姓名)
#        成績系統[位置+1] = int(成績)
#        print(成績系統)
#if 操作 == "D":
#    姓名 = input("請問要刪除哪位學生：")
#    if 姓名 not in 成績系統:
#        print("查無此人")
#    else:
#        位置 = 成績系統.index(姓名)
#        成績系統.pop(位置)
#        成績系統.pop(位置)
#        print(成績系統)

正確密碼 = "1234"
for 次數 in range(5):
    密碼 = input("請輸入密碼：")
    if 密碼 == 正確密碼:
        print("密碼正確")
    elif 密碼 != 正確密碼 and 次數 <4:
        print(f"""密碼錯誤
您還剩下{4-次數}次機會""")
    else:
        print("您輸入太多次錯誤密碼，帳號已被鎖定")
